# list [] - список
# tuple - кортеж
# set {} - множество
# dict {'key':'value'} - словарь


# Дан список чисел.
# Определите, сколько в нем встречается различных чисел.

# 1 вариант решения:

# list_1 = [1, 2, 2, 3, 4, 1, 2, 5]
# print(len(set(list_1)))

# 2 вариант решения:

# list_num = list(input('Введите числа: '))
# unic_list = []
# for i in list_num:
#     if not i in unic_list:
#         unic_list.append(i)
# print(list_num)
# print(unic_list)
# print(len(unic_list))

# ---------------------------------------------------------------------------------------------------------------

# Дана последовательность из N целых чисел и число K.
# Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо, K – положительное число.


# numder_list = [1, 2, 3, 4, 5, 6]
# print(numder_list)
# for i in range(3):
#     numder_list.insert(0, numder_list.pop())
# print(numder_list)

# ---------------------------------------------------------------------------------------------------------------
# Дан список состоящий из целых чисел. Напишите программу, которая подсчитает количество элементов списка больших предыдущего элемента с предыдущим номером.

# num_list = [1, 5, 4, 3, 2, 5, 6, 7, 5, 4, 3]
# count = 0
# k = len(num_list) - 1
# for i in range(k):
#     if num_list[i] < num_list[i+1]:
#         count += 1
# print(count)

# ---------------------------------------------------------------------------------------------------------------

# Вытащить все уникальные значения словаря
my_dict = [
    {'V':'S001'},
    {'V':'S002'},
    {'VI':'S001'},
    {'VI':'S005'},
    {'VII':'S001'},
    {'V':'S009'},
    {'VIII':'S007'}
    ]
uniq = set()
for item in my_dict:
    for value in item.values():
        uniq.add(value)
print(uniq)

